{
	"research": [
		{
			"title": "Remote Visualization of Large-Scale Data",
			"dates": "2018-Present",
			"image": "images/research/research_remotevis.jpg",
			"link": "research/remotevis.html",
			"description": [
				"In order to harness the power of distributed rendering and the real-time nature of local rendering, this research focuses on developing a streaming framework to transfer dynamically rendered images from high-performance graphics clusters to remote machines in real-time.",
				"Local display systems can range from a standard computer with single monitor to a cluster-driven tiled display wall. Additionally, multiple concurrent endpoints can receive a visualization to allow collaborators at different physical locations to simultaneously view the image stream."
			]
		},
		{
			"title": "Interactive Supercomputing",
			"dates": "2015-2018",
			"image": "images/research/research_sc.jpg",
			"link": "research/interactivesc.html",
			"description": [
				"Research at Argonne National Laboratory focuses on executing analytic tasks at the same time as large-scale simulations are running on leadership computing resources. This research will enable researchers to view intermediate results and make real-time decisions, which can lead to a shortened time-to-discovery."
			]
		},
		{
			"title": "SAGE2&trade; Collaborative Multi-user Operating Environment",
			"dates": "2013-2015",
			"image": "images/research/research_sage2.jpg",
			"link": "research/sage2.html",
			"description": [
				"This research focuses on the next generation of scalable high-resolution collaboration spaces. SAGE2 is a multi-user operating environment that enhances co-located and remote collaboration by leveraging large-scale shared displays. The framework provides a ubiquitous computing platform to enable real-time data-conferencing using a Scalable Resolution Shared Display and networked personal devices, which are used for simultaneous multi-user interaction and document sharing. The shared display acts as a seamless ultra high-resolution windowing environment for documents and applications."
			]
		},
		{
			"title": "Visualization of the Human Cerebral Vascular System",
			"dates": "2011-2013",
			"image": "images/research/research_bio.jpg",
			"link": "research/cerebroview.html",
			"description": [
				"In this collaboration between the UIC Departments of BioEngineering, Neurosurgery, and Computer Science, I developed graphical stereoscopic visual applications for a standard single monitor as well as an ultra-high resolution multi-paneled platform. The visualization focused on viewing 4D (space and time) medical images from angiography, MRI, CT, and blood flow simulations for individual patients. These visualization tools have enhanced insight about the pathology of patients suffering from neurovascular disease, especially stroke. Improved preparation for surgical intervention is expected to empower surgeons to choose better medical treatment paths."
			]
		},
		{
			"title": "Database Deadlock Prevention",
			"dates": "2010-2011",
			"image": "images/research/research_db.jpg",
			"description": [
				"In production systems, many applications often access the same databases concurrently causing database deadlocks to routinely occur. This results in major performance degradation for the applications. This research project aimed to automatically detect and prevent such database deadlocks by intercepting SQL statements sent to databases, detecting a potential deadlock, and delaying problematic SQL statements - thus effectively breaking the deadlock cycle. In three tested applications, our approach resulted in an increased throughput by approximately up to three orders of magnitude."
			]
		},
		{
			"title": "Multivariate Visualization of Chromatography for Chemical Analysis",
			"dates": "2009-2010",
			"image": "images/research/research_chem.jpg",
			"description": [
				"Three-dimensional data visualization was used to plot chromatography systems. This research led to more efficient identification of systems used for modifying the selectivity of the separation in complex chemical mixtures. This research soon evolved to require higher dimensional analysis. The research team used parallel coordinates and 3D glyph representation to enhance their prior work."
			]
		},
		{
			"title": "Volumetric Visualization of Seyfert Galaxies",
			"dates": "2009",
			"image": "images/research/research_astro.jpg",
			"description": [
				"Volumetric visualization of data from the Hubble Space Telescope was used to help astronomers understand the kinematics of ionized gas in the nuclear regions of Seyfert galaxies, the most common active galactic nuclei. The goal was to compare spectroscopic-analysis results with the expectations from various gas flow models to determine the dominant acceleration mechanism. This research was done as part of DUSCI, the Drake Undergraduate Science Collaborative Institute."
			]
		}
	]
}